{
  "日本語": "日本語",
  "English": "English",
  "Top": "Top",
  "Services": "Services",
  "Profile": "Profile",
  "Company": "Company",
  "Strategic Implementation": "Strategic Implementation",
  "Implement Your Business.": "Implement Your Business.",
  "Deliver Through Code.": "Deliver Through Code.",
  "戦略を描くだけでなく、動くシステムとして実装する。": "We don't just draw strategies—we implement them as working systems.",
  "アドテクの事業開発から、タクシーサイネージのハードウェア統合まで。": "From ad-tech business development to taxi signage hardware integration.",
  "TechTalkは技術と事業の両面から0→1を生み出してきました。": "TechTalk has created 0→1 value from both technical and business perspectives.",
  "お問い合わせ": "Contact Us",
  "サービス詳細": "View Services",
  "TechTalkの提供価値": "TechTalk's Value Proposition",
  "株式会社TechTalkは、技術と事業の両方を理解した上で実装を行う会社です。多くのコンサルティング会社が戦略立案や技術顧問といった抽象的な価値提案に終始する中で、TechTalkは実際に動くシステムを構築します。": "TechTalk, Inc. is a company that implements solutions with a deep understanding of both technology and business. While many consulting firms focus on abstract value propositions like strategy formulation and technical advisory, TechTalk builds actual working systems.",
  "代表の溝口浩二は現在もコードを書き続けており、経営判断と技術実装の両方に責任を持ちます。事業開発から立ち上げまでの経験が、複合的な実装力の源泉です。": "CEO Coji Mizoguchi continues to write code today and takes responsibility for both management decisions and technical implementation. Experience from business development to launch is the source of comprehensive implementation capabilities.",
  "OUR SERVICES": "OUR SERVICES",
  "4つのサービス領域": "Four Service Areas",
  "MVP Development & Architecture": "MVP Development & Architecture",
  "タクシーサイネージ事業を2名体制で立ち上げた経験から、限られたリソースで事業を形にする実装力を提供します。技術選定からアーキテクチャ設計まで、事業の成長を見据えた判断で市場投入を支援します。": "Drawing from the experience of launching a taxi signage business with just two people, we provide implementation capabilities to build businesses with limited resources. From technology selection to architecture design, we support market entry with decisions that anticipate business growth.",
  "成長を見据えた技術選定": "Technology selection for growth",
  "最小限のコストで市場検証": "Market validation at minimal cost",
  "事業フェーズに応じた設計判断": "Design decisions aligned with business phase",
  "Data Infrastructure & Analytics": "Data Infrastructure & Analytics",
  "DSPの入札ロジック構築でデータアナリストとして機械学習モデルを開発した経験から、ビジネス課題を解決するデータ基盤を構築します。DuckDB、dbt、BigQueryを用いて、意思決定を支えるデータ活用を実装します。": "Drawing from experience developing machine learning models as a data analyst for DSP bidding logic, we build data infrastructure that solves business challenges. Using DuckDB, dbt, and BigQuery to implement data utilization that supports decision-making.",
  "ビジネス課題に直結するデータ設計": "Data design directly tied to business challenges",
  "分析から可視化まで一貫構築": "End-to-end analytics to visualization",
  "機械学習モデルの実装支援": "Machine learning model implementation",
  "AI Integration & Strategy": "AI Integration & Strategy",
  "技術トレンドと事業価値の両面から、生成AIの実装判断を行います。Vercel AI SDKなどの最新技術を使い、実際に動く形でAIの価値を実証。戦略立案から実装まで一貫して提供します。": "Making generative AI implementation decisions from both technology trends and business value perspectives. Using cutting-edge technologies like Vercel AI SDK to demonstrate AI value in actual working form. Providing everything from strategy to implementation.",
  "ROIを意識したAI活用戦略": "ROI-focused AI strategy",
  "プロダクトへのAI統合実装": "AI integration into products",
  "プロンプトエンジニアリング": "Prompt engineering",
  "Project Leadership & Advisory": "Project Leadership & Advisory",
  "フリークアウトでの事業開発、IRISでの経営経験から、技術とビジネスの両面を理解した判断を提供します。開発マネジメント、技術選定、マーケティング統合など、プロジェクトの重要な局面を支援します。": "From business development experience at FreakOut and executive experience at IRIS, providing judgments that understand both technology and business. Supporting critical project junctures including development management, technology selection, and marketing integration.",
  "経営視点での技術判断": "Technical decisions from executive perspective",
  "少数精鋭チームのマネジメント": "Lean team management",
  "事業KPIを意識した開発推進": "KPI-driven development",
  "CORE TECHNOLOGIES": "CORE TECHNOLOGIES",
  "代表取締役": "CEO",
  "溝口 浩二": "Coji Mizoguchi",
  "Coji Mizoguchi": "Coji Mizoguchi",
  "1999年、ドワンゴでエンジニアとしてキャリアをスタート。ニコニコ動画の成長期を技術面から支えた後、フリークアウトでは事業開発とデータ分析の両面を経験。": "Started career as an engineer at Dwango in 1999. After supporting Niconico's growth from the technical side, gained experience in both business development and data analysis at FreakOut.",
  "2016年、タクシーサイネージ事業IRISを2名で立ち上げ、代表取締役副社長として経営と実装を統括。2019年にTechTalkを設立し、現在も自らコードを書き続けています。": "In 2016, launched taxi signage business IRIS with two people, overseeing both management and implementation as Executive Vice President. Founded TechTalk in 2019 and continues to write code today.",
  "経営判断と技術実装の両方に責任を持ち、事業の立ち上げ期や重要な技術判断が必要な局面で、判断の速度と実装の質を提供します。": "Taking responsibility for both business decisions and technical implementation, providing speed of judgment and quality of execution at business launch phases and critical technical decision points.",
  "ひとり法人の強み": "Solo Corporation Advantage",
  "大規模な開発体制ではなく、代表が全案件に直接関わることで、ビジネス理解と技術実装を一体化。戦略立案から実装まで、意思決定の速度を保ちながら価値を届けます。": "Rather than large development teams, the CEO's direct involvement in all projects integrates business understanding with technical implementation. Delivering value from strategy to execution while maintaining speed of decision-making.",
  "詳しい略歴を見る": "View Full Biography",
  "会社概要": "Company Information",
  "会社名": "Company Name",
  "株式会社TechTalk": "TechTalk, Inc.",
  "設立": "Established",
  "2019年7月": "July 2019",
  "所在地": "Address",
  "〒104-0051 東京都中央区佃2-1-2": "2-1-2 Tsukuda, Chuo-ku, Tokyo 104-0051, Japan",
  "事業内容": "Business",
  "ソフトウェア開発、技術コンサルティング": "Software Development, Technical Consulting",
  "技術実装、プロジェクト推進、技術顧問など、どのような形でのご相談も受け付けています。": "We accept consultations in any form including technical implementation, project advancement, and technical advisory.",
  "抱えている課題と期待する成果をお聞かせください。": "Please share your challenges and expected outcomes.",
  "EMAIL": "EMAIL",
  "メールアドレスをコピー": "Copy Email Address",
  "Copied!": "Copied!",
  "MESSENGER": "MESSENGER",
  "Facebook Messengerでもお気軽にご連絡ください": "Feel free to contact us via Facebook Messenger",
  "TechTalk Inc.": "TechTalk Inc.",
  "© TechTalk Inc. All Rights Reserved.": "© TechTalk Inc. All Rights Reserved.",
  "トップへ戻る": "Back to Top",
  "Biography": "Biography",
  "技術と事業の両面から0→1を生み出す": "Creating 0→1 value from both technical and business perspectives",
  "CONNECT": "CONNECT",
  "CAREER": "CAREER",
  "2019年 - 現在": "2019 - Present",
  "株式会社TechTalk 代表取締役": "TechTalk, Inc. - CEO",
  "ひとり法人として複数の企業に対して技術実装を提供。化学物質検索システム、AI活用MVP、データパイプライン、マーケティング統合など、幅広い領域で実装を継続。": "Providing technical implementation to multiple companies as a solo corporation. Continues implementing across a wide range of areas including chemical substance search systems, AI-leveraged MVPs, data pipelines, and marketing integration.",
  "2016年 - 2019年": "2016 - 2019",
  "株式会社IRIS 代表取締役副社長": "IRIS, Inc. - Executive Vice President",
  "タクシーサイネージ事業を2名体制で立ち上げ。事業計画の立案から経営レベルのマネジメント、ハードウェア・動画広告・配信システムの統合まで、事業と技術のすべてを統括。": "Launched taxi signage business with a team of two. Oversaw all aspects of business and technology, from business planning to executive-level management, including hardware, video advertising, and distribution system integration.",
  "2013年 - 2016年": "2013 - 2016",
  "株式会社FreakOut(現 株式会社フリークアウト・ホールディングス)": "FreakOut Holdings, Inc. (formerly FreakOut, Inc.)",
  "技術に基づいた事業開発やアライアンスに従事。DSPの入札ロジック構築においてはデータアナリストとして機械学習モデルの開発・分析を担当し、ビジネスと技術の接続を主導。": "Engaged in technology-driven business development and alliances. Led the connection between business and technology as a data analyst in developing and analyzing machine learning models for DSP bidding logic.",
  "1999年 - 2013年": "1999 - 2013",
  "株式会社ドワンゴ / 株式会社ニワンゴ": "Dwango Co., Ltd. / Niwango, Inc.",
  "エンジニア、プログラマーとしてキャリアをスタート。着メロサービス、動画サービス、ポータルサイトなどのエンジニアリングマネージャーを経験。ニワンゴでは技術担当取締役を担当。": "Started career as an engineer and programmer. Gained experience as engineering manager across multiple businesses including ringtone services, video services, and portal sites. Served as CTO at Niwango.",
  "MEDIA COVERAGE": "MEDIA COVERAGE",
  "Forbes JAPAN": "Forbes JAPAN",
  "ウィズコロナ時代の「タクシーサイネージ」最前線": "The forefront of 'Taxi Signage' in the COVID-19 era",
  "THE BRIDGE": "THE BRIDGE",
  "「本田の描く広告の未来を実現する」ーー隠れたキーマンを調べるお・フリークアウト、溝口氏インタビュー": "\"Realizing Honda's Vision of Advertising's Future\" - Interview with FreakOut's Hidden Key Person, Mizoguchi",
  "CNET Japan": "CNET Japan",
  "ニワンゴ技術責任者が語る、「ニコニコ動画」成功の鍵": "Niwango's CTO Discusses the Key to 'Niconico Douga's' Success"
}
